# FilterStringLessOrEqual Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterStringLessOrEqual Constructor
FilterStringLessOrEqual Class See Also
---
Constructs an instance of FilterStringLessOrEqual.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FilterStringLessOrEqual()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
FilterStringLessOrEqual()
```

# See Also
FilterStringLessOrEqual Class
Autodesk.Revit.DB Namespace